I am able to create 4 network end point groups (for the 4 zones) with your config. I am using terraform version 13.x, can you check the same on your end. If its happening only on terraform 14.x then its upstream terraform core issue

  ```
Terraform v0.13.4
+ provider registry.terraform.io/hashicorp/google v3.62.0
+ provider registry.terraform.io/hashicorp/google-beta v3.54.0
+ provider registry.terraform.io/hashicorp/random v3.1.0

```
Plan output
```
  google_compute_network_endpoint_group.foo[3] will be created
  + resource "google_compute_network_endpoint_group" "foo" {
      + id                    = (known after apply)
      + name                  = "terraform-test-3"
      + network               = "default"
      + network_endpoint_type = "GCE_VM_IP_PORT"
      + project               = (known after apply)
      + self_link             = (known after apply)
      + size                  = (known after apply)
      + zone                  = "us-central1-f"
    }
```